application/modules/Custom/Interbrain/Perfect2/requestC.xml

<?xml version="1.0" encoding="UTF-8"?> 
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"
    xmlns:ns1="http://interbrain.p2online/" xmlns:enc="http://www.w3.org/2003/05/soap-encoding"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/">
    <env:Body>
        <ns1:ValidateOrder/>
        <param1>
            <Items>
                <SOAP-ENC:Struct>
                    <OrderPosition>
                        <item>
                            <key>Id</key>
                            <value>1</value>
                        </item>
                        <item>
                            <key>Client</key>
                            <value>
                                <Typ>2</Typ>
                                <EMailAddress>a.kummer@wdrei.ch</EMailAddress>
                            </value>
                        </item>
                        <item>
                            <key>ItemID</key>
                            <value>GU00000000010000000002</value>
                        </item>
                        <item>
                            <key>ItemLanguage</key>
                            <value>SD</value>
                        </item>
                        <item>
                            <key>Quantity</key>
                            <value>1</value>
                        </item>
                    </OrderPosition>
                </SOAP-ENC:Struct>
                <SOAP-ENC:Struct>
                    <OrderPosition>
                        <item>
                            <key>Id</key>
                            <value>2</value>
                        </item>
                        <item>
                            <key>Client</key>
                            <value>
                                <Typ>2</Typ>
                                <EMailAddress>a.kummer@wdrei.ch</EMailAddress>
                            </value>
                        </item>
                        <item>
                            <key>ItemID</key>
                            <value>GU00000000010000000003</value>
                        </item>
                        <item>
                            <key>ItemLanguage</key>
                            <value>SD</value>
                        </item>
                        <item>
                            <key>Quantity</key>
                            <value>1</value>
                        </item>
                    </OrderPosition>
                </SOAP-ENC:Struct>
            </Items>
        </param1>
    </env:Body>
</env:Envelope>
